package com.zwds.serviceImpl;

import com.zwds.pojo.Star;
import com.zwds.service.StarService;

import java.util.List;

public class StarServiceImpl implements StarService {
    @Override
    public List<Star> setSiHua(List<Star> stars) {
        return null;
    }

    @Override
    public List<Star> setBright(List<Star> stars) {
        String[][][] arr = {
                {
                    {"天机","天府","太阴","天相","天梁","破军","禄存"},
                    {"武曲","天同","贪狼","巨门","七杀"},
                    {"文昌","文曲"},
                    {},
                    {"紫微","廉贞"},
                    {},
                    {"太阳","擎羊","火星","铃星"}
                },
                {
                    {"紫微","武曲","天府","太阴","贪狼","天相","七杀","文昌","文曲","天机","擎羊","陀罗"},
                    {"天梁","破军"},
                    {"火星","铃星"},
                    {"廉贞"},
                    {},
                    {"太阳","天同","巨门"},
                    {"天机"}
                },
                {
                    {"廉贞","天府","巨门","天相","天梁","七杀","禄存","火星","铃星"},
                    {"紫微","太阳","太阴"},
                    {"天机","武曲","破军"},
                    {"天同"},
                    {"贪狼","文曲"},
                    {},
                    {"文昌","陀罗"}
                },
                {
                    {"太阳","巨门","天梁","禄存"},
                    {"紫微","天机","七杀","文曲"},
                    {"天府"},
                    {"武曲","贪狼","文昌","火星","铃星"},
                    {"天同","廉贞"},
                    {},
                    {"天相","陀罗","破军","擎羊"}
                },
                {
                    {"武曲","天府","贪狼","天梁","七杀","擎羊","陀罗"},
                    {"太阳","破军"},
                    {"紫微","天相","文昌","文曲"},
                    {"廉贞","天机"},
                    {"天同"},
                    {},
                    {"太阴","巨门","火星","铃星"}
                },
                {
                    {"天同","文昌","文曲","禄存"},
                    {"紫微","太阳","巨门"},
                    {"天相","天府","火星","铃星"},
                    {},
                    {"天机","武曲","七杀","破军"},
                    {},
                    {"廉贞","太阴","贪狼","天梁","陀罗"},
                },
                {
                        {"紫微","天机","天相","天梁","破军","禄存","火星","铃星",},
                        {"太阳","武曲","天府","贪狼","巨门","七杀",},
                        {},
                        {},
                        {"廉贞",},
                        {"太阴",},
                        {},
                        {"天同","文昌","文曲","擎羊"},
                },
                {
                        {"紫微","天府","武曲","七杀","贪狼","陀罗","擎羊"},
                        {"天梁","文曲","破军"},
                        {"太阳","天相"},
                        {"廉贞","文昌","火星","铃星"},
                        {},
                        {"太阴","巨门","天同"},
                        {"天机"},
                },
                {
                        {"廉贞","巨门","天相","七杀","禄存",},
                        {"紫微","天同"},
                        {"天机","太阳","武曲","天府","破军","文昌","文曲"},
                        {"太阴",},
                        {"贪狼",},
                        {},
                        {"天梁","陀罗","火星","铃星"},
                },
                {
                        {"巨门","文昌","文曲","禄存",},
                        {"紫微","天机","天府","太阴","七杀",},
                        {"天梁","火星","铃星"},
                        {"武曲","贪狼",},
                        {"太阳","天同","廉贞"},
                        {},
                        {"天相","擎羊","破军"},
                },
                {
                        {"天府","武曲","七杀","贪狼","天梁","陀罗","火星","铃星","擎羊"},
                        {"太阴","破军"},
                        {"紫微","天相"},
                        {"天机","廉贞"},
                        {"天同"},
                        {"太阳"},
                        {"文昌","文曲","巨门"},
                },
                {
                        {"太阴","天同","禄存"},
                        {"紫微","文曲","巨门",},
                        {"天府","天相"},
                        {"文昌","火星","铃星"},
                        {"天机","武曲","七杀","破军"},
                        {},
                        {"廉贞","贪狼","天梁","陀罗","太阳"},
                },




        };
        return null;
    }
}
